dots/emacs/1_chemacs_testing/test/config.org
#+title: Asynthe's Emacs Config
#+author: Benjamin Dunstan
#+startup: overview
#+property: header-args :tangle config.el
#+auto_tangle: t

Welcome to my custom Emacs configuration!

[Cool Emacs logo with cat]

* Table of Contents :toc:
- [[#info][Info]]
  - [[#keybinds][Keybinds]]
- [[#main][Main]]
  - [[#system][System]]
  - [[#configuration][Configuration]]
  - [[#ui][UI]]
  - [[#font][Font]]
  - [[#font-ligatures][Font Ligatures]]
  - [[#auctex][AucTeX]]
  - [[#buffer][Buffer]]
  - [[#irc][IRC]]
- [[#org][Org]]
  - [[#configuration-1][Configuration]]
  - [[#code-blocks][Code Blocks]]
  - [[#roam][Roam]]
  - [[#agenda][Agenda]]
  - [[#journal][Journal]]
  - [[#pomodoro][Pomodoro]]
  - [[#latex-preview][Latex Preview]]
  - [[#packages][Packages]]
- [[#keybinds-1][Keybinds]]
  - [[#main-1][Main]]
  - [[#org-1][Org]]
  - [[#temporarily-removed][Temporarily Removed]]
- [[#packages-1][Packages]]
  - [[#system-1][System]]
  - [[#ui-1][UI]]
- [[#extra---packages][Extra - Packages]]
  - [[#blog---simple-httpd][Blog - simple-httpd]]
- [[#extra---configuration][Extra - Configuration]]
  - [[#open-a-file-instead-of-scratch-buffer][Open a file instead of /Scratch/ buffer]]
  - [[#ui---render-modeline-just-in-active-window][UI - Render Modeline just in active window]]
  - [[#disable-yesno-when-cancelling-note-on-org-capture][Disable Yes/No when Cancelling Note on Org Capture]]
  - [[#disable-follow-git-controlled-symbolic-link][Disable follow Git-controlled symbolic link]]
- [[#disabled][Disabled]]
  - [[#pdf-tools][pdf-tools]]
  - [[#llm-ellama][LLM (ellama)]]
- [[#delete--add-in-future][Delete / Add in Future]]
  - [[#vertico][Vertico]]
  - [[#marginalia][Marginalia]]
  - [[#keycast][Keycast]]
  - [[#backups][Backups]]
  - [[#eaf-emacs-application-framework][EAF (Emacs Application Framework)]]
  - [[#org-gtd][ORG GTD]]
  - [[#websocket-exists][websocket [EXISTS?]]]
  - [[#ement][Ement]]
  - [[#good-scroll][Good Scroll]]
- [[#working-but-removed][Working but Removed]]
  - [[#aggresive-indent-mode][Aggresive Indent Mode]]

* Info

My Emacs config.

*EMACS TERMINOLOGY*
|------------+----------------|
| usual term | emacs term     |
|------------+----------------|
| open file  | buffer         |
| window     | window / frame |
|------------+----------------|

** Keybinds

#+CAPTION: My list of keybindings
|----------+---------+--------------|
| Keybinds | Command | What it does |
|----------+---------+--------------|
| SPC w c  |         |              |
| ...      |         |              |
| IN       | PRO     | GRESS        |
| ...      |         |              |
|----------+---------+--------------|

* Main
** System
*** Native Compilation

Silence compiler warnings as they can be pretty disruptive
#+begin_src emacs-lisp
(if (boundp 'comp-deferred-compilation)
    (setq comp-deferred-compilation nil)
    (setq native-comp-deferred-compilation nil))
#+end_src

In noninteractive sessions, prioritize non-byte-compiled source files to prevent the use of stale byte-code. Otherwise, it saves us a little IO time to skip the mtime checks on every *.elc file.

#+begin_src emacs-lisp
(setq load-prefer-newer noninteractive)
#+end_src

*** Garbage Collection

#+begin_src emacs-lisp
;; Using garbage magic hack.
;;(use-package gcmh
  ;;:config
  ;;(gcmh-mode 1))
;; Setting garbage collection threshold
;;(setq gc-cons-threshold 402653184
      ;;gc-cons-percentage 0.6)

;; Profile emacs startup
;;(add-hook 'emacs-startup-hook
          ;;(lambda ()
            ;;(message "*** Emacs loaded in %s with %d garbage collections."
                     ;(format "%.2f seconds"
                             ;;(float-time
                             ;;(time-subtract after-init-time before-init-time)))
                     ;;gcs-done)))

#+end_src

Silence compiler warnings as they can be pretty disruptive
#+begin_src emacs-lisp
;;(setq comp-async-report-warnings-errors nil)
#+end_src

*** Runtime Performance

#+begin_src emacs-lisp
;; Make gc pauses faster by decreasing the threshold.
(setq gc-cons-threshold (* 2 1000 1000))
#+end_src

*** Auto-refresh buffer if buffer changes

- [[https://stackoverflow.com/questions/1480572/how-to-have-emacs-auto-refresh-all-buffers-when-files-have-changed-on-disk][How to have Emacs auto-refresh all buffers when files have changed on disk? - StackOverflow]]

#+begin_src emacs-lisp
(global-auto-revert-mode t)
#+end_src

*** Package Manager / Sources

Get working with the MELPA and ELPA repositories.

+ [[https://menno.io/posts/use-package/][Better Emacs Config: use-package - menno i/o]]
+ [[https://ianyepan.github.io/posts/setting-up-use-package/][A Quick Tutorial on Use-package for Emacs - Ian Y.E. Pan]]

#+begin_src emacs-lisp
;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
   (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

** Configuration
*** Daemon

_note_: Doesn't work on Wayland.

#+begin_src emacs-lisp
;;(server-start)
#+end_src

*** General

#+begin_src emacs-lisp
  (use-package general
    :config
    (general-evil-setup t))
#+end_src

*** Evil Mode / Evil Collection

It's vim, on emacs!

+ [[https://github.com/noctuid/evil-guide][Evil Guide - github page]]
+ [[https://github.com/emacs-evil/evil][Evil Mode - github page]]
+ [[https://github.com/emacs-evil/evil-collection][Evil Collection - github page]] (Enables having the evil keybindings everywhere.)

#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-integration t) ;; This is optional, set on by default
  (setq evil-want-keybinding nil)
  (setq evil-want-fine-undo t)
  :config
  (evil-mode 1))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(evil-define-key 'normal org-mode-map (kbd "<tab>") #'org-cycle)

;; Override pdf-tools mode
;;(evil-make-overriding-map pdf-view-mode-map 'normal)
#+end_src

*** Evil Surround

+ [[https://github.com/emacs-evil/evil-surround][github page]]

#+begin_src emacs-lisp
(use-package evil-surround
  :config
  (global-evil-surround-mode 1))
#+end_src

*** Code - Language Support

#+begin_src emacs-lisp
(use-package haskell-mode)
(use-package json-mode)
(use-package lua-mode)
(use-package markdown-mode)
(use-package nix-mode
  :mode "\\.nix\\'")
#+end_src

** UI
*** Minimalist Menu

#+begin_src emacs-lisp
(setq inhibit-startup-message t)

(scroll-bar-mode -1)     ; Disable visible scrollbar
(tool-bar-mode -1)       ; Disable the toolbar
(tooltip-mode -1)        ; Disable tooltips
(menu-bar-mode -1)       ; Disable the menu bar

;;(set-fringe-mode 10)   ; Give some breathing room
(set-fringe-mode 0)      ; No fringes, please

;; Set Margins / Padding
(setq-default left-margin-width 5 right-margin-width 5)
(set-window-buffer nil (current-buffer))

;; Set up the visible bell
(setq visible-bell t)
(setq ring-bell-function 'ignore)

;; Copy from X11 apps (something temporary)
(setq x-select-enable-clipboard t)

;; Delete selected text
(delete-selection-mode t)

;; Don't do file backups (file.org~)
(setq make-backup-files nil)
;; (setq backup-directory-alist '((".*" . "~/.config/emacs/backup"))) ; Backups on a specific folder

#+end_src

*** Tabline

#+begin_src emacs-lisp
(global-tab-line-mode -1)
;;(setq tab-line-new-button-show nil) ;; do not show add-new button
;;(setq tab-line-close-button-show nil) ;; do not show close button
;;(setq tab-line-separator "/")
;;(setq tab-line-separator "") ;; set to empty

;; tab color settings

;;(set-face-attribute 'tab-line nil ;; background behind tabs
      ;;:background "gray40"
      ;;:foreground "gray60" :distant-foreground "gray50"
      ;;:height 1.0 :box nil)
;;(set-face-attribute 'tab-line-tab nil ;; active tab in another window
      ;;:inherit 'tab-line
      ;;:foreground "gray70" :background "gray90" :box nil)

;;(set-face-attribute 'tab-line-tab-current nil ;; active tab in current window
      ;;:background "#b34cb3" :foreground "white" :box nil)
;;(set-face-attribute 'tab-line-tab-inactive nil ;; inactive tab
      ;;:background "gray60" :foreground "black" :box nil)
;;(set-face-attribute 'tab-line-highlight nil ;; mouseover
      ;;:background "white" :foreground 'unspecified)
#+end_src

*** Modeline

#+begin_src emacs-lisp
(set-face-attribute 'mode-line-inactive nil
		          :underline t
			  :background (face-background 'default))
#+end_src

*** Line Numbering and Truncated Lines

Disable line numbering in /Org/ or /Markdown/.

#+begin_src emacs-lisp
;; Line numbers and truncated lines

;;(global-display-line-numbers-mode t)
;; (global-display-line-numbers-mode -1)
(global-visual-line-mode t)

;; See column line in little mode
(column-number-mode)

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
		term-mode-hook
		shell-mode-hook
		eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

*** Transparency

- [[https://kristofferbalintona.me/posts/202206071000/][True Emacs Transparency - Kristoffer Balintona]]
_note_: Works on X windows with a compositor like [[id:a2042b5e-f0a2-4213-a8c8-2fd9cd9636d8][picom]], but in Wayland case, you will need pure GTK emacs.

#+begin_src emacs-lisp
(set-frame-parameter nil 'alpha-background 0.75) ; For current frame
(add-to-list 'default-frame-alist '(alpha-background .75)) ; For all new frames henceforth

;;(defun toggle-window-transparency ()
  ;;"Toggle transparency."
  ;;(interactive)
  ;;(let ((alpha-transparency 55))
    ;;(pcase (frame-parameter nil 'alpha-background)
      ;;(alpha-transparency (set-frame-parameter nil 'alpha-background 100))
      ;;(t (set-frame-parameter nil 'alpha-background alpha-transparency)))))
#+end_src

*BACKGROUND*

Is not possible at a glance, but it seems there's a /frame.c/ as mentioned in this stack question, in any case, i don't have enough time to check it. Here is the [[https://stackoverflow.com/questions/2010158/setting-an-emacs-background-image][link]].

