dots/emacs/config.el
(if (boundp 'comp-deferred-compilation)
    (setq comp-deferred-compilation nil)
    (setq native-comp-deferred-compilation nil))

(setq load-prefer-newer noninteractive)

;; Using garbage magic hack.
;;(use-package gcmh
  ;;:config
  ;;(gcmh-mode 1))
;; Setting garbage collection threshold
;;(setq gc-cons-threshold 402653184
      ;;gc-cons-percentage 0.6)

;; Profile emacs startup
;;(add-hook 'emacs-startup-hook
          ;;(lambda ()
            ;;(message "*** Emacs loaded in %s with %d garbage collections."
                     ;(format "%.2f seconds"
                             ;;(float-time
                             ;;(time-subtract after-init-time before-init-time)))
                     ;;gcs-done)))

;;(setq comp-async-report-warnings-errors nil)

;; Make gc pauses faster by decreasing the threshold.
(setq gc-cons-threshold (* 2 1000 1000))

(global-auto-revert-mode t)

;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
   (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

;;(server-start)

(use-package general
  :config
  (general-evil-setup t))

(use-package evil
  :init
  (setq evil-want-integration t) ;; This is optional, set on by default
  (setq evil-want-keybinding nil)
  (setq evil-want-fine-undo t)
  :config
  (evil-mode 1))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(evil-define-key 'normal org-mode-map (kbd "<tab>") #'org-cycle)

;; Override pdf-tools mode
;;(evil-make-overriding-map pdf-view-mode-map 'normal)

(use-package evil-surround
  :config
  (global-evil-surround-mode 1))

(use-package haskell-mode)
(use-package json-mode)
(use-package lua-mode)
(use-package markdown-mode)
(use-package nix-mode
  :mode "\\.nix\\'")

(setq focus-follows-mouse t)
(setq mouse-autoselect-window t)

(setq inhibit-startup-message t)

(scroll-bar-mode -1)     ; Disable visible scrollbar
(tool-bar-mode -1)       ; Disable the toolbar
(tooltip-mode -1)        ; Disable tooltips
(menu-bar-mode -1)       ; Disable the menu bar

;;(set-fringe-mode 10)   ; Give some breathing room
(set-fringe-mode 0)      ; No fringes, please

;; Set Margins / Padding
(setq-default left-margin-width 5 right-margin-width 5)
(set-window-buffer nil (current-buffer))

;; Set up the visible bell
(setq visible-bell t)
(setq ring-bell-function 'ignore)

;; Copy from X11 apps (something temporary)
(setq x-select-enable-clipboard t)

;; Delete selected text
(delete-selection-mode t)

;; Don't do file backups (file.org~)
(setq make-backup-files nil)
;; (setq backup-directory-alist '((".*" . "~/.config/emacs/backup"))) ; Backups on a specific folder

(global-tab-line-mode -1)
;;(setq tab-line-new-button-show nil) ;; do not show add-new button
;;(setq tab-line-close-button-show nil) ;; do not show close button
;;(setq tab-line-separator "/")
;;(setq tab-line-separator "") ;; set to empty

;; tab color settings

;;(set-face-attribute 'tab-line nil ;; background behind tabs
      ;;:background "gray40"
      ;;:foreground "gray60" :distant-foreground "gray50"
      ;;:height 1.0 :box nil)
;;(set-face-attribute 'tab-line-tab nil ;; active tab in another window
      ;;:inherit 'tab-line
      ;;:foreground "gray70" :background "gray90" :box nil)

;;(set-face-attribute 'tab-line-tab-current nil ;; active tab in current window
      ;;:background "#b34cb3" :foreground "white" :box nil)
;;(set-face-attribute 'tab-line-tab-inactive nil ;; inactive tab
      ;;:background "gray60" :foreground "black" :box nil)
;;(set-face-attribute 'tab-line-highlight nil ;; mouseover
      ;;:background "white" :foreground 'unspecified)

(set-face-attribute 'mode-line-inactive nil
		          :underline t
			  :background (face-background 'default))

;; Line numbers and truncated lines

;;(global-display-line-numbers-mode t)
;; (global-display-line-numbers-mode -1)
(global-visual-line-mode t)

;; See column line in little mode
(column-number-mode)

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
		term-mode-hook
		shell-mode-hook
		eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(set-frame-parameter nil 'alpha-background 100) ; For current frame
(add-to-list 'default-frame-alist '(alpha-background .100)) ; For all new frames henceforth

;;(set-frame-parameter nil 'alpha-background 0.7) ; For current frame
;;(add-to-list 'default-frame-alist '(alpha-background .70)) ; For all new frames henceforth

;;(defun toggle-window-transparency ()
  ;;"Toggle transparency."
  ;;(interactive)
  ;;(let ((alpha-transparency 55))
    ;;(pcase (frame-parameter nil 'alpha-background)
      ;;(alpha-transparency (set-frame-parameter nil 'alpha-background 100))
      ;;(t (set-frame-parameter nil 'alpha-background alpha-transparency)))))
