dots/emacs/config.el

(setq scroll-conservatively 101) ;; Value greater than 100 gets rid of half page jumping
(setq scroll-step 1) ;; Keyboard scroll one line at a time

;; Mouse
(setq mouse-wheel-scroll-amount '(3 ((shift) . 3))) ;; How many lines at a time
(setq mouse-wheel-progressive-speed t) ;; Accelerate scrolling
(setq mouse-wheel-follow-mouse 't) ;; Scroll window under mouse

;; Precision pixel scroll
 
(pixel-scroll-precision-mode 1)
(setq pixel-scroll-precision-use-momentum t) ;; Keep the momentum (notice on touchpad)
(setq pixel-scroll-precision-large-scroll-height 40.0) ;; Scroll with mouse as smooth as touchpad
;; If it doesn't work, decrease by 5 until it works.

(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
;;(global-set-key (kbd "C-0") '(lambda () (interactive) (text-scale-adjust 0))) ;; return to default
(global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
(global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)

(use-package doom-themes)
(load-theme 'doom-meltbus t)
(setq doom-themes-enable-bold t)        ; if nil, bold is disabled
(setq doom-themes-enable-italic t)      ; if nil, italics is disabled

(set-face-attribute 'default nil
	  :font "JetBrainsMono Nerd Font 12"
	  :weight 'regular)
(set-face-attribute 'variable-pitch nil
	  :font "JetBrainsMono Nerd Font 12"
	  :weight 'regular)

;; org-table and org-block are inherited from this face
(set-face-attribute 'fixed-pitch nil
	  :font "JetBrainsMono Nerd Font 12"
	  :weight 'regular)

;; Org Faces
(defun my-org-faces ()
  (set-face-attribute 'org-todo nil :height 0.8)
  (set-face-attribute 'org-level-1 nil :height 1.0)
  (set-face-attribute 'org-level-2 nil :height 1.0)
  (set-face-attribute 'org-level-3 nil :height 1.0))

(add-hook 'org-mode-hook #'my-org-faces)

;; Needed if using emacs client. Otherwise, your fonts will be smaller than expected.
(add-to-list 'default-frame-alist '(font . "JetBrainsMono Nerd Font 12"))

(use-package ligature
  :config
  (ligature-set-ligatures 'prog-mode '("<---" "<--"  "<<-" "<-" "->" "-->" "--->" "<->" "<-->" "<--->" "<---->" "<!--"
                                       "<==" "<===" "<=" "=>" "=>>" "==>" "===>" ">=" "<=>" "<==>" "<===>" "<====>" "<!---"
                                       "<~~" "<~" "~>" "~~>" "::" ":::" "==" "!=" "===" "!=="
                                       ":=" ":-" ":+" "<*" "<*>" "*>" "<|" "<|>" "|>" "+:" "-:" "=:" "<******>" "++" "+++"))
  (ligature-set-ligatures 'org-mode '("<---" "<--"  "<<-" "<-" "->" "-->" "--->" "<->" "<-->" "<--->" "<---->" "<!--"
                                       "<==" "<===" "<=" "=>" "=>>" "==>" "===>" ">=" "<=>" "<==>" "<===>" "<====>" "<!---"
                                       "<~~" "<~" "~>" "~~>" "::" ":::" "==" "!=" "===" "!=="
                                       ":=" ":-" ":+" "<*" "<*>" "*>" "<|" "<|>" "|>" "+:" "-:" "=:" "<******>" "++" "+++"))
  (global-ligature-mode t))

(use-package auctex
  :hook
  (LaTeX-mode . turn-on-prettify-symbols-mode)
  (LaTeX-mode . turn-on-flyspell))

(require 'latex)

(setq TeX-engine-alist '((default
                          "Tectonic"
                          "tectonic -X compile -f plain %T"
                          "tectonic -X watch"
                          nil)))

;; Changing a file name from the buffer
(defun rename-current-buffer-file ()
  "Renames current buffer and the file it is visiting."
  (interactive)
  (let* ((name (buffer-name))
	    (filename (buffer-file-name))
	    (basename (file-name-nondirectory filename)))
    (if (not (and filename (file-exists-p filename)))
	    (error "Buffer '%s' is not visiting a file!" name)
      (let ((new-name (read-file-name "New name: " (file-name-directory filename) basename nil basename)))
	   (if (get-buffer new-name)
	       (error "A buffer name '%s' already exists!" new-name)
	     (rename-file filename new-name 1)
	     (rename-buffer new-name)
	     (set-visited-file-name new-name)
	     (set-buffer-modified-p nil)
	     (message "File '%s' successfully renamed to '%s'"
		      name (file-name-nondirectory new-name)))))))

(defun kill-other-buffers ()
  "Kill all other buffers."
  (interactive)
  (mapc 'kill-buffer
	(delq (current-buffer)
	      (remove-if-not 'buffer-file-name (buffer-list)))))

(defun toggle-maximize-buffer ()
  "Toggle maximize buffer"
  (interactive)
  (if (= 1 (length (window-list)))
      (progn
        (set-window-configuration my-saved-window-configuration)
        (goto-char my-saved-point))
    (setq my-saved-window-configuration (current-window-configuration)
          my-saved-point (point))
    (delete-other-windows)))

(setq erc-prompt (lambda () (concat "[" (buffer-name) "]"))
      erc-server "irc.libera.chat"
      erc-nick "meowtoo"
      erc-user-full-name "Benjamin"
      erc-track-shorten-start 24
      erc-autojoin-channels-alist '(("irc.libera.chat" "#gentoo-chat"))
      erc-kill-buffer-on-part t
      erc-fill-column 100
      erc-fill-function 'erc-fill-static
      erc-fill-static-center 20
      ;; erc-auto-query 'bury
      )
