dots/emacs/1_chemacs_testing/test/config.org
** Configuration

+ [[https://stackoverflow.com/questions/64665754/is-there-a-way-to-hide-all-but-the-last-header-asterisk-in-emacs-org-mode][Is there a way to hide all but the last header asterisk in emacs org-mode? - StackOverflow]]

If you want to mark a work of sentence with bold, you can do it with
C-c C-x C-f * -> Mark as bold
C-c C-x C-f / -> Mark as /italic/
C-c C-x C-f _ -> Mark as _underline_
C-c C-x C-f ~ -> Mark as code
C-c C-x C-f = -> Mark as verbatim

If you have a text which has the * character or /, and it bolds or italicizes where you don't want to.
Use (= / =) -> delete the spaces,

#+begin_src emacs-lisp
;; Directory and others
(setq org-directory "~/sync"
      org-id-track-globally t
      org-log-done 'time
      org-startup-folded t
      ;;org-startup-latex-with-latex-preview t ;; Org-fragtog enables it.
      org-hide-emphasis-markers t ;; Org styling, hide markup, etc.
      org-hide-leading-stars t ;; Hide org header leading stars.
      org-pretty-entities t
      org-ellipsis " … ")

;; Enable the mouse
(require 'org-mouse)

;; * following links with the left mouse button
;; * subtree expansion/collapse (org-cycle) with the left mouse button
;; * several context menus on the right mouse button:
;;    + general text
;;    + headlines
;;    + timestamps
;;    + priorities
;;    + links
;;    + tags
;; * promoting/demoting/moving subtrees with mouse-3
;;    + if the drag starts and ends in the same line then promote/demote
;;    + otherwise move the subtree

;; To do keywords
(setq org-todo-keywords '((sequence "TODO(t)" "WAIT(w)" "|" "DONE(d)" "CANCELLED(c)" ))
      org-log-done 'time
      ;;org-log-done 'note
      org-fancy-priorities-list '("[A]" "[B]" "[C]")
      org-priority-faces
      '((?A :foreground "#ff6c6b" :weight bold)
        (?B :foreground "#98be65" :weight bold)
        (?C :foreground "#c678dd" :weight bold)))
      ;; just-saving this stuff
      ;;org-enable-priority-commands t
      ;;org-highest-priority ?A
      ;;org-default-priority ?B
      ;;org-lowest-priority ?D)

;; Start in ...
(add-hook 'org-mode-hook 'org-indent-mode)
;; If using Org-capture, start with Insert mode
(add-hook 'org-capture-mode-hook 'evil-insert-state)

;; from DT
(setq org-src-preserve-indentation nil)
;;    org-src-tab-acts-natively t
;;	  org-edit-src-content-indentation 0)

;; Return follows Org links (Special for Org roam)
(setq org-return-follows-link t)

;; RETURN thing 
;;(setq org-M-RET-may-split-line '((item . nil)))
;; Make M-RET not add blank lines when doing a new org heading
(setq org-blank-before-new-entry (quote ((heading . nil)
					     (plain-list-item . nil))))

;; Start with display images
(setq org-startup-with-inline-images t)
(setq org-image-actual-width nil) ;; Set width as nil, enable attrs to edit width
#+end_src

*** Org Headers Size

#+begin_src emacs-lisp
;; Headings Size
;(custom-set-faces
; '(org-level-1 ((t (:inherit outline-1 :height 1.0))))
; '(org-level-2 ((t (:inherit outline-2 :height 0.9))))
; '(org-level-3 ((t (:inherit outline-3 :height 0.8))))
; '(org-level-4 ((t (:inherit outline-4 :height 0.8))))
; '(org-level-5 ((t (:inherit outline-5 :height 0.8))))
; '(org-document-title ((t (:inherit outline-3 :height 0.8)))))

(custom-set-faces
 '(org-level-1 ((t (:inherit outline-1 :height 1.0))))
 '(org-level-2 ((t (:inherit outline-2 :height 1.0))))
 '(org-level-3 ((t (:inherit outline-3 :height 1.0))))
 '(org-level-4 ((t (:inherit outline-4 :height 1.0))))
 '(org-level-5 ((t (:inherit outline-5 :height 1.0))))
 '(org-document-title ((t (:inherit outline-3 :height 0.8)))))

;; Font size
(set-face-attribute 'default nil :height 160)

;; Set all to text size
;;(require 'org-faces
;;  (dolist (face '(org-document-title
;;                 org-level-1
;;                 org-level-2
;;                 org-level-3))
;;(set-face-attribute face nil :height 1.0)))
#+end_src

*** Text Indentation

+ [[https://emacs.stackexchange.com/questions/70228/why-does-org-mode-not-indent-content-under-headings-when-i-press-tab][Why does org-mode not indent content under headings when I press tab? - StackExchange]]
  
Org's indentation behaviour is controlled by the org-adapt-indentation variable. It can be set to three states:

/t/: Adapt indentation for all lines
/headline-data/: Adapt indentation for headline data lines
/nil/: Do not adapt indentation at all

If you want org-mode to indent heading content, do (setq org-adapt-indentation t).

#+begin_src emacs-lisp
(setq org-adapt-identation nil)
#+end_src

*** Don't follow/open org buffers in split window

For this we need *org-link-frame-setup* to use _find-file_ instead of _find-file-other-window_

To do this:
- Open customize-variable, *M-x customize variable RET*
- Go into *org-link-frame-setup RET*
- Click Value Menu next to *find-file-other-window* and select *find-file*
- Click *Apply and Save*.

_note_: disable evil mode *(M-x turn-off-evil-mode RET*) if the menu doesn't appear.

** Code Blocks

- [[https://orgmode.org/worg/org-contrib/babel/languages/index.html][List of supported languages]]
  
Some of them: *awk, c, c++, emacs-lisp, elisp (preferred emacs-lisp for this config), haskell, java, python, latex, lisp, lua, shell, R, ruby, sass, scheme, sqlite...*

*** Background color of Code Blocks

#+begin_src emacs-lisp
;;(require 'color)
;;(set-face-attribute 'org-block nil :background
;;                    (color-darken-name
;;                     (face-attribute 'default :background) 3))

;; Language specific
(setq org-src-block-faces '(("bash" (:background "#121212" :extend t))
                          ("c" (:background "#121212" :extend t))
			        ("cpp" (:background "#121212" :extend t))
				("emacs-lisp" (:background "#121212" :extend t))
			        ("haskell" (:background "#121212" :extend t))
				("latex" (:background "#121212" :extend t))
                          ("lua" (:background "#121212" :extend t))
			        ("org" (:background "#121212" :extend t))
                          ("python" (:background "#121212" :extend t))
				("pwsh" (:background "#012456" :extend t))
				("text" (:background "#121212" :extend t))
                          ("nix" (:background "#121212" :extend t))
			        ("shell" (:background "#121212" :extend t))))

             ;;(custom-set-faces
             ;; '(org-block-begin-line
             ;;   ((t (:underline "#A7A6AA" :foreground "#008ED1" :background "#EAEAFF" :extend t))))
             ;; '(org-block
             ;;   ((t (:background "EFF0F1" :extend t))))
             ;; '(org-block-end-line
             ;;   ((t (:overline "#A7A6AA" :foreground "#008ED1" :background"EAEAFF" :extend t))))
             ;; )
#+end_src

*** Don't fold Code Blocks in Org mode

#+begin_src emacs-lisp
(setq org-hide-block-startup nil)
#+end_src

*** Block Tag (org-tempo)

This will allow us to create the code block just by typing ~<s~ then pressing ~TAB~.

 #+begin_src emacs-lisp
 (use-package org-tempo
   :ensure nil) ;; tell use-package not to try to install org-tempo since it's already there.
 #+end_src

*** Syntax Highlighting
 #+begin_src emacs-lisp
 (setq org-src-fontify-natively t
       org-src-tab-acts-natively t
       org-confirm-babel-evaluate nil
       org-edit-src-content-indentation 0)
 #+end_src

