dots/emacs/1_chemacs_testing/test/config.org
** Roam

Remember to check for EmacSQL SQLite binary with *org-roam--sqlite-available-p*

#+begin_src emacs-lisp
(use-package org-roam
  :init
  (setq org-roam-v2-ack t)
  :config
  (org-roam-db-autosync-mode)
  (require 'org-roam-protocol) ;; If using org-roam-protocol
  :custom
  (org-roam-directory "~/sync")
  ;;(org-roam-dailies-directory  "personal/daily") ;; From org-roam-directory
  (org-roam-completion-everywhere t)
  (org-roam-capture-templates
             '(("d" "default" plain
		    "%?"
		    :if-new (file+head "%<%Y%m%d>-${slug}.org" "#+title: ${title}\n")
		    :unnarrowed t)
	       
             ("a" "app" plain
             (file "~/sync/notes/.org/templates/app.org")
             :if-new
             (file+head "not_ready/app/%<%Y%m%d>-${slug}.org" "#+title: ${title}\n")
             :unnarrowed t)

            ("b" "book" plain
             (file "~/sync/notes/.org/templates/booknote.org")
             :if-new
             (file+head "personal/book/%<%Y>-${slug}.org" "#+title: ${title}\n")
             :unnarrowed t)
   
            ("n" "note" plain
             (file "~/sync/notes/.org/templates/note.org")
             :if-new
             (file+head "personal/notes/%<%Y%m%d>-${slug}.org" "#+title: ${title}\n")
             :unnarrowed t))))
#+end_src

,#+begin_src emacs-lisp
             '(("a" "app" plain
             (file "~/sync/notes/personal/templates/app.org")
             :if-new
             (file+head "not_ready/app/%<%Y%m%d>-${slug}.org" "#+title: ${title}\n")
             :unnarrowed t)

	       
            ("e" "blog" plain
             (file "~/sync/notes/personal/templates/blog.org")
             :if-new
             (file+head "not_ready/blog/%<%Y%m%d>-${slug}.org" "#+title: ${title}\n")
             :unnarrowed t)


            ("g" "guide" plain
             (file "~/sync/notes/personal/templates/guide.org")
             :if-new
             (file+head "not_ready/guide/%<%Y%m%d>-${slug}.org" "#+title: ${title}\n")
             :unnarrowed t)


            ("s" "study" plain
             (file "~/sync/notes/personal/templates/study.org")
             :if-new
             (file+head "not_ready/study/%<%Y%m%d>-${slug}.org" "#+title: ${title}\n")
             :unnarrowed t)

	        ;; PERSONAL

            ("b" "book" plain
             (file "~/sync/notes/personal/templates/booknote.org")
             :if-new
             (file+head "personal/book/%<%Y>-${slug}.org" "#+title: ${title}\n")
             :unnarrowed t)

	    
            ("n" "note" plain
             (file "~/sync/notes/personal/templates/note.org")
             :if-new
             (file+head "personal/notes/%<%Y%m%d>-${slug}.org" "#+title: ${title}\n")
             :unnarrowed t)

	    
            ("m" "media" plain
             (file "~/sync/notes/personal/media.org")
            :if-new
            (file+head "personal/media/%<%Y%m%d>-${slug}.org" "#+title: ${title}\n")
            :unnarrowed t))))
,#+end_src

#+begin_src emacs-lisp
            ;;("p" "project" plain "* Goals\n\n%?\n\n* ;;Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
             ;;:if-new
             ;;(file+head "irl/project/%<%Y%m%d>-${slug}.org" "#+title: ${title}\n#+filetags: Project")
             ;;:unnarrowed t)

            ;;("w" "work" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
             ;;:if-new
             ;;(file+head "irl/work/%<%Y%m%d>-${slug}.org" "#+title: ;;${title}\n#+filetags: Project")
             ;;:unnarrowed t))))

;; :config
;;(setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
;; If you're using a vertical completion framework, you might want a more informative completion interface 

;; Configuration of the roam buffer as a side-window
(add-to-list 'display-buffer-alist
	           '("\\*org-roam\\*"
		      (display-buffer-in-direction)
		      (direction . right)
		      (window-width . 0.33)
		      (window-height . fit-window-to-buffer)))

;; Navigation in roam buffer
;;(define-key org-roam-mode-map [mouse-1] #'org-roam-visit-thing)
(define-key org-roam-mode-map [mouse-1] #'org-roam-preview-visit)
#+end_src

*** Graph (org-roam-ui)

- [[https://github.com/org-roam/org-roam-ui][github page]]

A graphical frontend for exploring your org-roam Zettelkasten.
Requires:
- websocket
- simple-httpd

#+begin_src emacs-lisp
(use-package org-roam-ui
  :config
  (setq org-roam-ui-sync-theme t
	      org-roam-ui-follow t
	      org-roam-ui-update-on-save t
	      org-roam-ui-open-on-start t))

;;(setq org-roam-graph-viewer nil) ;; use view-file by default
;;(setq org-roam-graph-viewer #'eww-open-file) ;; open the graph in eww.
#+end_src

** Agenda

;;#+begin_src emacs-lisp
(setq org-agenda-files '("~/sync/notes/1_personal/daily")
      ;;org-agenda-include-diary t
      org-agenda-block-separator 8411
      org-agenda-start-on-weekday nil
      org-agenda-start-day "-3d"
      org-agenda-span 15
      org-agenda-custom-commands
      '(("v" "A better agenda view"
	 ((tags "PRIORITY=\"A\""
		((org-agenda-skip-function
		  '(org-agenda-skip-entry-if 'todo 'done))
		 (org-agenda-overriding-header "High-priority unfinished tasks:")))
	  (tags "PRIORITY=\"C\""
		((org-agenda-skip-function
		  '(org-agenda-skip-entry-if 'todo 'done))
		 (org-agenda-overriding-header
		  "Medium-priority unfinished tasks:")))
	  (tags "PRIORITY=\"D\""
		((org-agenda-skip-function
		  '(org-agenda-skip-entry-if 'todo 'done))
		 (org-agenda-overriding-header "Low-priority
unfinished tasks:")))
	  (agenda "")
	  (alltodo "")))))

;; ORG-AGENDA from ORG-ROAM NOTES
(defun my/org-roam-filter-by-tag (tag-name)
  (lambda (node)
    (member tag-name (org-roam-node-tags node))))

(defun my/org-roam-list-notes-by-tag (tag-name)
  (mapcar #'org-roam-node-file
	  (seq-filter
	   (lambda (node)
	     (member tag-name (org-roam-node-tages node)
		     (my/org-roam-filter-by-tag tag-name))))))
;;#+end_src

** Journal

#+begin_src emacs-lisp
(use-package org-journal
         :config
        (setq org-journal-dir "~/sync/notes/personal/journal"
              org-journal-file-format "%Y-%m-%d.org"
              org-journal-date-prefix "#+title: "
              org-journal-date-format "%a, %d-%m-%Y"
              org-journal-time-prefix "* "))
 #+end_src

** Pomodoro

[[https://en.wikipedia.org/wiki/Pomodoro_Technique][Pomodoro Technique - wikipedia page]]

Run a timer with ~M-x org-pomodoro RET~

#+begin_src emacs-lisp
(use-package org-pomodoro)
#+end_src

** Latex Preview

\begin{equation}                        % arbitrary environments,
x=\sqrt{b}                              % even tables, figures
\end{equation}                          % etc

If $a^2=b$ and \( b=2 \), then the solution must be
either $$ a=+\sqrt{2} $$ or \[ a=-\sqrt{2} \].

You can use *C-h v org-format-latex-options RET* to understand what can be changed in this variable.

#+begin_src emacs-lisp
(setq org-format-latex-options (plist-put org-format-latex-options :scale 1.5))
#+end_src

*** Automatic Fragment Preview (org-fragtog)

+ [[https://github.com/io12/org-fragtog][org-fragtog - github page]]

#+begin_src emacs-lisp
(use-package org-fragtog)
(add-hook 'org-mode-hook 'org-fragtog-mode)
#+end_src

** Packages
*** Auto-tangle (org-auto-tangle)

Enable it by specifying the ~#+auto_tangle: t~ property in org files.

#+begin_src emacs-lisp
(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode))
#+end_src

*** Table of Contents (toc-org)

Generate table of contents by using the *toc* package, then just add to the beggining of your file.

*Table of Contents :toc:*

It will be automatically updated while you save your file, so no worries.

#+begin_src emacs-lisp
(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

*** Org Superstar

#+begin_src emacs-lisp
(use-package org-superstar)
(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))
#+end_src

*** Org -> reveal.js (ox-reveal)

+ [[https://github.com/hexmode/ox-reveal][ox-reveal - github page]]

The original org-reveal has been abandoned, that why ox-reveal it's used instead.

#+begin_src emacs-lisp
(use-package ox-reveal)
#+end_src

*** Export to Manpage (ox-man)

#+begin_src emacs-lisp
(use-package ox-man
  :ensure nil)
#+end_src

* Keybinds
** Main
*** Main / Evil

*Table of Keyboard Binds* (SPC)
|---------+-----------------------------+---------------------------------|
| Bind    | Command                     | Use                             |
|---------+-----------------------------+---------------------------------|
| SPC .   | counsel-find-file           | Change into another file.       |
| SPC ,   | perps-counsel-switch-buffer | Switch buffer. (with preview)   |
| SPC /   | persp-switch                | Change workspace. (perspective) |
|         |                             |                                 |
| SPC q q | kill-emacs                  | Exit emacs without saving.      |
| SPC q s | save-buffers-kill-emacs     | Exit emacs saving all buffers.  |
|---------+-----------------------------+---------------------------------|

*Table of Keyboard Binds*
|------+-----------------+----------------------------|
| Bind | Command         | Use                        |
|------+-----------------+----------------------------|
| M-[  | previous-buffer | Change to previous buffer. |
| M-]  | next-buffer     | Change to next buffer.     |
|------+-----------------+----------------------------|

#+begin_src emacs-lisp
(nvmap :states '(normal) :keymaps 'override :prefix "SPC"

       ;; Perspective Binds (Find-file / Switch-buffer)
       "."   '(counsel-find-file :which-key "Find file")
       ","   '(persp-counsel-switch-buffer :which-key "Switch buffer")
       "/"   '(persp-switch :which-key "Change workspace")

       ;; Exit emacs
       "q q" '(kill-emacs :which-key "Exit emacs without saving")
       "q s" '(save-buffers-kill-emacs :which-key "Exit emacs saving all the buffers")
      
       ;; Helpful
       "h v" '(counsel-describe-variable :which-key "Describe variable")
       "d f" '(describe-font :which-key "Describe font"))
#+end_src

Disable Space, Enter and Tab for use in other Keybinds such as the *General* ones.

#+begin_src emacs-lisp
(with-eval-after-load 'evil-maps
  (define-key evil-motion-state-map (kbd "SPC") nil)
  (define-key evil-motion-state-map (kbd "RET") nil))
  ;;(define-key evil-motion-state-map (kbd "TAB") nil))

#+end_src

Use TAB to fold block without having to go to header.

+ [[https://stackoverflow.com/questions/8607656/emacs-org-mode-how-to-fold-block-without-going-to-block-header][Emacs Org-Mode: how to fold block without going to block header? - StackOverflow]]
+ [[https://emacs.stackexchange.com/questions/28222/how-to-make-tab-work-in-org-mode-when-combined-with-evil-mode][How to make <tab> work in org mode when combined with evil mode? - StackExchange]]

#+begin_src emacs-lisp
;; Keybinding for Evil Mode
(evil-define-key 'normal org-mode-map (kbd "<tab>") #'zin/org-cycle-current-headline)

;; Here's the function.
;;(defun zin/org-cycle-current-headline ()
  ;;(interactive)
  ;;(outline-previous-heading)
  ;;(org-cycle))

(defun zin/org-cycle-current-headline ()
  (interactive)
  (org-cycle-internal-local))
#+end_src

