dots/emacs/config.el
  (setq org-roam-v2-ack t)

  ;;:config
  (org-roam-db-autosync-mode)
  (require 'org-roam-protocol) ;; If using org-roam-protocol

  :custom
  (org-roam-directory "~/sync/notes")
  ;;(org-roam-dailies-directory  "personal/daily") ;; From org-roam-directory
  (org-roam-completion-everywhere t)
  (org-roam-capture-templates
             '(("d" "default" plain
		    "%?"
		    :if-new (file+head "%<%Y%m%d>-${slug}.org" "#+title: ${title}\n")
		    :unnarrowed t)
	       
             ("a" "app" plain
             (file "~/sync/notes/.org/templates/app.org")
             :if-new
             (file+head "not_ready/app/%<%Y%m%d>-${slug}.org" "#+title: ${title}\n")
             :unnarrowed t)

            ("b" "book" plain
             (file "~/sync/notes/.org/templates/booknote.org")
             :if-new
             (file+head "personal/book/%<%Y>-${slug}.org" "#+title: ${title}\n")
             :unnarrowed t)
   
            ("n" "note" plain
             (file "~/sync/notes/.org/templates/note.org")
             :if-new
             (file+head "personal/notes/%<%Y%m%d>-${slug}.org" "#+title: ${title}\n")
             :unnarrowed t))))

;;("p" "project" plain "* Goals\n\n%?\n\n* ;;Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
             ;;:if-new
             ;;(file+head "irl/project/%<%Y%m%d>-${slug}.org" "#+title: ${title}\n#+filetags: Project")
             ;;:unnarrowed t)

            ;;("w" "work" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
             ;;:if-new
             ;;(file+head "irl/work/%<%Y%m%d>-${slug}.org" "#+title: ;;${title}\n#+filetags: Project")
             ;;:unnarrowed t))))

;; :config
;;(setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
;; If you're using a vertical completion framework, you might want a more informative completion interface 

;; Configuration of the roam buffer as a side-window
(add-to-list 'display-buffer-alist
	           '("\\*org-roam\\*"
		      (display-buffer-in-direction)
		      (direction . right)
		      (window-width . 0.33)
		      (window-height . fit-window-to-buffer)))

;; Navigation in roam buffer
;;(define-key org-roam-mode-map [mouse-1] #'org-roam-visit-thing)
(define-key org-roam-mode-map [mouse-1] #'org-roam-preview-visit)

(use-package org-roam-ui
  :config
  (setq org-roam-ui-sync-theme t
	      org-roam-ui-follow t
	      org-roam-ui-update-on-save t
	      org-roam-ui-open-on-start t))

;;(setq org-roam-graph-viewer nil) ;; use view-file by default
;;(setq org-roam-graph-viewer #'eww-open-file) ;; open the graph in eww.

(use-package org-journal
         :config
        (setq org-journal-dir "~/sync/notes/personal/journal"
              org-journal-file-format "%Y-%m-%d.org"
              org-journal-date-prefix "#+title: "
              org-journal-date-format "%a, %d-%m-%Y"
              org-journal-time-prefix "* "))

(use-package org-pomodoro)

(setq org-format-latex-options (plist-put org-format-latex-options :scale 1.5))

(use-package org-fragtog)
(add-hook 'org-mode-hook 'org-fragtog-mode)

(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode))

(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))

(use-package org-superstar)
(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))

(use-package ox-reveal)

(use-package ox-man
  :ensure nil)

(nvmap :states '(normal) :keymaps 'override :prefix "SPC"

       ;; Perspective Binds (Find-file / Switch-buffer)
       "."   '(counsel-find-file :which-key "Find file")
       ","   '(persp-counsel-switch-buffer :which-key "Switch buffer")
       "/"   '(persp-switch :which-key "Change workspace")

       ;; Exit emacs
       "q q" '(kill-emacs :which-key "Exit emacs without saving")
       "q s" '(save-buffers-kill-emacs :which-key "Exit emacs saving all the buffers")
      
       ;; Helpful
       "h v" '(counsel-describe-variable :which-key "Describe variable")
       "d f" '(describe-font :which-key "Describe font"))

(with-eval-after-load 'evil-maps
  (define-key evil-motion-state-map (kbd "SPC") nil)
  (define-key evil-motion-state-map (kbd "RET") nil))
  ;;(define-key evil-motion-state-map (kbd "TAB") nil))

;; Keybinding for Evil Mode
(evil-define-key 'normal org-mode-map (kbd "<tab>") #'zin/org-cycle-current-headline)

;; Here's the function.
;;(defun zin/org-cycle-current-headline ()
  ;;(interactive)
  ;;(outline-previous-heading)
  ;;(org-cycle))

(defun zin/org-cycle-current-headline ()
  (interactive)
  (org-cycle-internal-local))
