dots/emacs/config.el

;; easy window swap
(global-set-key (kbd "s-n") 'window-swap-states)

;; window switch - vi keys
(global-set-key (kbd "s-h") 'windmove-left)
(global-set-key (kbd "s-j") 'windmove-down)
(global-set-key (kbd "s-k") 'windmove-up)
(global-set-key (kbd "s-l") 'windmove-right)

;; window switch - arrow keys
;; very easy
(windmove-default-keybindings 'super)

;; window resize - vi keys
(global-set-key (kbd "s-C-h") 'shrink-window-horizontally)
(global-set-key (kbd "s-C-j") 'enlarge-window)
(global-set-key (kbd "s-C-k") 'shrink-window)
(global-set-key (kbd "s-C-l") 'enlarge-window-horizontally)

;; window resize - arrow keys
(global-set-key (kbd "s-<left>") 'shrink-window-horizontally)
(global-set-key (kbd "s-<down>") 'enlarge-window)
(global-set-key (kbd "s-<up>") 'shrink-window)
(global-set-key (kbd "s-<right>") 'enlarge-window-horizontally)

;; other
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(global-set-key (kbd "M-[") 'previous-buffer)
(global-set-key (kbd "M-]") 'next-buffer)

(nvmap :prefix "SPC"
      "b b" '(ibuffer :which-key "Ibuffer")
      "b l" '(ibuffer-list-buffers :which-key "Ibuffer list buffers")
      "b n" '(next-buffer :which-key "Next buffer")
      "b p" '(previous-buffer :which-key "Previous buffer")
      "b c" '(clone-indirect-buffer-other-window :which-key "Clone indirect buffer other window")
      "b k" '(kill-current-buffer :which-key "Kill current buffer")
      "b K" '(kill-buffer-and-window :which-key "Kill current buffer and window")
      ;;"b K" '(kill-buffer :which-key "Kill buffer")
      "b m" '(toggle-maximize-buffer :which-key "Maximize buffer") ;; From the Extra function

      ;; With n / p
      "b n" '(next-buffer :which-key "Next buffer")
      "b p" '(previous-buffer :which-key "Previous buffer"))

(nvmap :states '(normal visual) :keymaps 'override :prefix "SPC"
       "f f" '(find-file :which-key "Find file")
       "f r" '(rename-current-buffer-file :which-key "Rename current buffer filename")
       ;;"f r"   '(counsel-recentf :which-key "Recent files")
       ;; put recent files in SPC + /
       "f s" '(save-buffer :which-key "Save file")
       "f u" '(sudo-edit-find-file :which-key "Sudo find file")
       "f y" '(dt/show-and-copy-buffer-path :which-key "Yank file path")
       "f C" '(copy-file :which-key "Copy file")
       "f D" '(delete-file :which-key "Delete file")
       "f R" '(rename-file :which-key "Rename file")
       "f S" '(write-file :which-key "Save file as...")
       "f U" '(sudo-edit :which-key "Sudo edit file"))

(nvmap :states '(normal) :keymaps 'override :prefix "SPC"

  ;;"c c" '(compile :which-key "Compile")
  ;;"c C" '(recompile :which-key "Recompile")
  ;;"c p" '(check-parens :which-key "Check parenthesis")   
  ;;"c b" '(beacon-blink :which-key "Blink cursor"))
  
  ;; Config files
  "l" '((lambda () (interactive (find-file "~/sync/notes/.writing/log.org"))) :which-key "Open log file")
  "c e" '((lambda () (interactive (find-file "~/.config/emacs/config.org"))) :which-key "Emacs configuration")
  "h r r" '((lambda () (interactive) (load-file "~/.config/emacs/init.el")) :which-key "Reload emacs config")

  ;; Configuration files 
  "c f" '((lambda () (interactive (find-file "~/flake/flake.org"))) :which-key "Nix flake configuration")
  "c t" '((lambda () (interactive (find-file "~/.config/tmux/README.org"))) :which-key "tmux configuration")
  "c l" '((lambda () (interactive (find-file "~/.config/lf/README.org"))) :which-key "lf configuration")
  "c v" '((lambda () (interactive (find-file "~/.config/nvim/README.org"))) :which-key "Neovim configuration")

  "c h" '((lambda () (interactive (find-file "~/.config/hypr/README.org"))) :which-key "Hyprland configuration")
  "c x" '((lambda () (interactive (find-file "~/.config/xmonad/README.org"))) :which-key "Xmonad configuration")

  "c b" '((lambda () (interactive (find-file "~/.config/bash/README.org"))) :which-key "Bash configuration")
  "c z" '((lambda () (interactive (find-file "~/.config/zsh/README.org"))) :which-key "Zsh configuration"))

(winner-mode 1)
(nvmap :prefix "SPC"
       ;; Window splits
       "w c" '(evil-window-delete :which-key "Close window")
       "w n" '(evil-window-new :which-key "New window")
       "w s" '(evil-window-split :which-key "Horizontal split window")
       "w v" '(evil-window-vsplit :which-key "Vertical split window")
       ;; Window motions
       "w h" '(evil-window-left :which-key "Window left")
       "w j" '(evil-window-down :which-key "Window down")
       "w k" '(evil-window-up :which-key "Window up")
       "w l" '(evil-window-right :which-key "Window right")
       "w w" '(evil-window-next :which-key "Goto next window")
       ;; winner mode
       "w <left>"  '(winner-undo :which-key "Winner undo")
       "w <right>" '(winner-redo :which-key "Winner redo"))

(global-set-key (kbd "s-{") 'persp-prev)
(global-set-key (kbd "s-}") 'persp-next)

(nvmap :states '(normal) :keymaps 'override :prefix "SPC"
       "p k" '(persp-kill :which-key "Kill workspace")
       "p r" '(persp-rename :which-key "Rename workspace")
       "p a" '(persp-add-buffer :which-key "Move a buffer to current workspace, no switching")
       "p m" '(persp-set-buffer :which-key "Move buffer to workspace and remove from all others"))

(nvmap :states '(normal) :keymaps 'override :prefix "SPC"

    ;; Open - Apps
    "o t" '(term :which-key "Open terminal")
    "e h" '(counsel-esh-history :which-key "Eshell history")
    "e s" '(eshell :which-key "Eshell")
    "m w" '(writeroom-mode :which-key "Writeroom mode"))
    "a c" '(org-mouse-insert-checkbox :which-key "Insert checkbox")

    ;; Log Buffer
    "l o" '((lambda () (interactive) (clm/toggle-command-log-buffer) (global-command-log-mode)) :which-key "Start command log mode")
    ;; Start log buffer
    "l s" '(global-command-log-mode :which-key "Turn on command log mode")
    "l b" '(clm/toggle-command-log-buffer :which-key "Open the command log buffer")

(nvmap :states '(normal) :keymaps 'override :prefix "SPC"

       ;; Org agenda
