dots/emacs/1_chemacs_testing/test/config.org
** Org

[INSERT TABLE WITH KEYBINDINGS HERE]

For the scroll lock (SPC t s), use C-l to put cursor on top, center or bottom.

+ [[https://stackoverflow.com/questions/17156595/in-emacs-org-mode-how-to-narrow-display-to-two-subtrees-in-two-separate-files][In Emacs org-mode, how to narrow display to two subtrees in two separate files? - StackOverflow]]

#+begin_src emacs-lisp
(nvmap :states '(normal) :keymaps 'override :prefix "SPC"

       ;; Org agenda
       "o a" '(org-agenda :which-key "Open agenda")
       "o s" '(org-time-stamp :which-key "Insert a time stamp")
       "RET" '(org-toggle-checkbox :which-key "Tick checkbox")
       
       ;; Org dailies
       ;;"n d d" '(org-roam-dailies-goto-date :which-key "Dailies calendar")
       ;;"n d d" '(org-roam-dailies-capture-today :which-key "Capture today") ;; I prefer using the calendar.
       ;;"n d n" '(org-roam-dailies-goto-tomorrow :which-key "Next day")
       ;;"n d p" '(org-roam-dailies-goto-yesterday :which-key "Previous day")

       ;; Org journal
       "n j" '(org-journal-new-entry :which-key "New entry")

       "j n" '(org-journal-next-entry :which-key "Next entry")
       "j p" '(org-journal-previous-entry :which-key "Previous entry")

       ;; S - start
       "s p" '(org-pomodoro :which-key "Start/end pomodoro timer")

       ;; I - Insert
       "i l" '(org-insert-link :which-key "Insert link")
       "i s" '(org-schedule :which-key "Insert SCHEDULE:")
       "i p" '(org-set-property :which-key "Insert PROPERTY:")

       ;; R - Roam
       "r a" '(org-roam-alias-add :which-key "Add alias to node")
       "r b" '(org-roam-buffer-toggle :which-key "Open roam buffer")
       "r i" '(org-id-get-create :which-key "Create org id")
       "r t" '(org-roam-tag-add :which-key "Add a tag to node")
       ;; R g - Roam Graph
       "r g" '(org-roam-ui-open :which-key "Open org-roam graph")
       ;;"r g" '(org-roam-graph :which-key "Open org-roam graph") [NOT WORKING]

       ;; D - Display
       "d L" '(org-toggle-link-display :which-key "Display links as plain text")
       "d i" '(org-toggle-inline-images :which-key "Org toggle inline imager")
       "d m" '(hide-mode-line-mode :which-key "Display/Hide modeline")
       "d a" '(global-hide-mode-line-mode :which-key "Display/Hide all modelines")
       ;;"d a" '(global-org-modern-mode :which-key "Activate org modern")

       ;; N (Notes) - Org capture
       "n n" '(org-roam-capture :which-key "New note")
       "n f" '(org-roam-node-find :which-key "Find note")
       "n d s" '(org-roam-db-sync :which-key "Database sync")
       "n i" '(org-roam-node-insert :which-key "Insert org-roam node link")

       ;; E (enter) - Narrow to
       "e e" '(widen :which-key "Widen / Escape narrowed area.")
       "e t" '(org-narrow-to-subtree :which-key "Narrow to subtree.")
       "e b" '(org-narrow-to-block :which-key "Narrow to source block / block of text.")
       "e l" '(org-narrow-to-element :which-key "Narrow to line."))
#+end_src

** Temporarily Removed
*** Random

"m *" '(org-ctrl-c-star :which-key "Org-ctrl-c-star")
"m +" '(org-ctrl-c-minus :which-key "Org-ctrl-c-minus")
"m ." '(counsel-org-goto :which-key "Counsel org goto")
"m e" '(org-export-dispatch :which-key "Org export dispatch")
"m f" '(org-footnote-new :which-key "Org footnote new")
"m n" '(org-store-link :which-key "Org store link")
"m t" '(org-todo :which-key "Org todo")
"m T" '(org-todo-list :which-key "Org todo list")
"o a" '(org-agenda :which-key "Org agenda")

"n r d" dailies file
"n r z" agenda cal-fw?
"n r x" tasks file

"d i" '(org-toggle-item :which-key "Org toggle item")
"d i" '(org-display-inline-images :which-key "Display images") ; How does this work?       
"t h" '(org-toggle-heading :which-key "Org toggle heading")
"t l" '(org-latex-preview :which-key "Toggle LaTeX fragment preview")

*** PDF Tools

#+begin_src emacs-lisp
(nvmap :states '(normal) :keymaps 'override :prefix "SPC"
       "p i" '(pdf-view-midnight-minor-mode :which-key "Invert PDF colors"))
#+end_src
 
*** Toggle

#+begin_src emacs-lisp
;;(nvmap :states '(normal) :keymaps 'override :prefix "SPC"
       ;; T - toggle
       ;;"t c" '(centered-cursor-mode :which-key "Toggle centered cursor mode")
       ;;"t C" '(global-centered-cursor-mode :which-key "Toggle centered cursor mode on all buffers"))
       ;;"t s" '(scroll-lock-mode :which-key "Scroll lock mode") ;; Disabled for centered-cursor-mode
       ;;"t t" '(toggle-window-transparency :which-key "Toggle transparency")
#+end_src

* Packages
** System
*** Perspective (Workspaces)

+ [[https://github.com/nex3/perspective-el][github page]]
+ [[https://youtu.be/uyMdDzjQFMU][Declutter Your Buffer Lists in Emacs with Perspective.el - System Crafters]]

#+begin_src emacs-lisp
(use-package perspective
  :bind
  ("C-x C-b" . persp-list-buffers)
  :custom
  (persp-mode-prefix-key (kbd "C-c M-p"))
  (persp-state-default-file "~/.config/emacs/persp-save")
  :init
  (persp-mode))
#+end_src

Save the session to disk.

You can save it with: *M-x persp-state-save*
You can load with: *M-x persp-state-load*

#+begin_src emacs-lisp
(add-hook 'kill-emacs-hook #'persp-state-save)
#+end_src

:bind (("C-x k" . persp-kill-buffer*))

_Note_: The default prefix for ~prespective.el~ bindings is ~C-x x~.

The "main" perspective

Listing buffers in the perspective
persp-ivy-switch-buffer
persp-counsel-switch-buffer
persp-ibuffer

works by default on vertico

*** Counsel

#+begin_src emacs-lisp
    (use-package counsel
      :bind (( "M-x" . counsel-M-x)
	( "C-x b" . counsel-ibuffer)
	( "C-x C-f" . counsel-find-file)
      :map minibuffer-local-map
	( "C-r" . 'counsel-minibuffer-history)))
  ;;    :config
(setq ivy-initial-inputs-alist nil) ;; Don't start searches with ^
#+end_src

*** Ivy

#+begin_src emacs-lisp
(ivy-mode)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)

(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
       :map ivy-minibuffer-map
       ("TAB" . ivy-alt-done)	
       ("C-l" . ivy-alt-done)
       ("C-j" . ivy-next-line)
       ("C-k" . ivy-previous-line)
       :map ivy-switch-buffer-map
       ("C-k" . ivy-previous-line)
       ("C-l" . ivy-done)
       ("C-d" . ivy-switch-buffer-kill) 
       :map ivy-reverse-i-search-map
       ("C-k" . ivy-previous-line)
       ("C-d" . ivy-reverse-i-search-kill)))
;;TEST (NOT WORKIGN YET)
;;(global-set-key (kbd "SPC .") 'counsel-find-file)
;;(global-set-key (kbd "SPC ,") 'counsel-switch-buffer)

;; enable this if you want `swiper' to use it
;; (setq search-default-mode #'char-fold-to-regexp)
;;(global-set-key "\C-s" 'swiper)
;;(global-set-key (kbd "C-c C-r") 'ivy-resume)
;;(global-set-key (kbd "<f6>") 'ivy-resume)
;;(global-set-key (kbd "M-x") 'counsel-M-x)
;;(global-set-key (kbd "C-x C-f") 'counsel-find-file)
;;(global-set-key (kbd "<f1> f") 'counsel-describe-function)
;;(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
;;(global-set-key (kbd "<f1> o") 'counsel-describe-symbol)
;;(global-set-key (kbd "<f1> l") 'counsel-find-library)
;;(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
;;(global-set-key (kbd "<f2> u") 'counsel-unicode-char)
;;(global-set-key (kbd "C-c g") 'counsel-git)
;;(global-set-key (kbd "C-c j") 'counsel-git-grep)
;;(global-set-key (kbd "C-c k") 'counsel-ag)
;;(global-set-key (kbd "C-x l") 'counsel-locate)
;;(global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
;;(define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)
#+end_src

*** Ivy-Rich

with *Counsel-m-X*, get descriptions of what commands do.

#+begin_src emacs-lisp
(use-package ivy-rich
  :init
  (ivy-rich-mode 1))
#+end_src

*** Smex

#+begin_src
(use-package smex)
(smex-initialize)
#+end_src

*** Dired

This is the file manager.

#+begin_src emacs-lisp
(use-package all-the-icons-dired)
(use-package dired-open)
(use-package peep-dired)

(nvmap :states '(normal visual) :keymaps 'override :prefix "SPC"
               "d d" '(dired :which-key "Open dired")
               "d j" '(dired-jump :which-key "Dired jump to current")
               "d p" '(peep-dired :which-key "Peep-dired"))

(with-eval-after-load 'dired
  ;;(define-key dired-mde-map (kbd "M-p") 'peep-dired)
  (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
  (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
  (evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file)
  (evil-define-key 'normal peep-dired-mode-map (kbd "k") 'peep-dired-prev-file))

(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
;; Get file icons in dired
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
;; Auto-refresh dired on file change
(add-hook 'dired-mode-hook 'auto-revert-mode)
;; With dired-open plugin, you can launch external programs for certain extensions
;; For example, I set all .png files to open in 'sxiv' and all .mp4 files to open in 'mpv'
(setq dired-open-extensions '(("gif" . "nsxiv")
                               ("jpg" . "nsxiv")
                              ("png" . "nsxiv")
                              ("mkv" . "mpv")
                              ("mp4" . "mpv")))
#+end_src

