dots/emacs/config.el
       "o a" '(org-agenda :which-key "Open agenda")
       "o s" '(org-time-stamp :which-key "Insert a time stamp")
       "RET" '(org-toggle-checkbox :which-key "Tick checkbox")
       
       ;; Org dailies
       ;;"n d d" '(org-roam-dailies-goto-date :which-key "Dailies calendar")
       ;;"n d d" '(org-roam-dailies-capture-today :which-key "Capture today") ;; I prefer using the calendar.
       ;;"n d n" '(org-roam-dailies-goto-tomorrow :which-key "Next day")
       ;;"n d p" '(org-roam-dailies-goto-yesterday :which-key "Previous day")

       ;; Org journal
       "n j" '(org-journal-new-entry :which-key "New entry")

       "j n" '(org-journal-next-entry :which-key "Next entry")
       "j p" '(org-journal-previous-entry :which-key "Previous entry")

       ;; S - start
       "s p" '(org-pomodoro :which-key "Start/end pomodoro timer")

       ;; I - Insert
       "i l" '(org-insert-link :which-key "Insert link")
       "i s" '(org-schedule :which-key "Insert SCHEDULE:")
       "i p" '(org-set-property :which-key "Insert PROPERTY:")

       ;; R - Roam
       "r a" '(org-roam-alias-add :which-key "Add alias to node")
       "r b" '(org-roam-buffer-toggle :which-key "Open roam buffer")
       "r i" '(org-id-get-create :which-key "Create org id")
       "r t" '(org-roam-tag-add :which-key "Add a tag to node")
       ;; R g - Roam Graph
       "r g" '(org-roam-ui-open :which-key "Open org-roam graph")
       ;;"r g" '(org-roam-graph :which-key "Open org-roam graph") [NOT WORKING]

       ;; D - Display
       "d L" '(org-toggle-link-display :which-key "Display links as plain text")
       "d i" '(org-toggle-inline-images :which-key "Org toggle inline imager")
       "d m" '(hide-mode-line-mode :which-key "Display/Hide modeline")
       "d a" '(global-hide-mode-line-mode :which-key "Display/Hide all modelines")
       ;;"d a" '(global-org-modern-mode :which-key "Activate org modern")

       ;; Notes - Org capture
       "n n" '(org-roam-capture :which-key "New note")
       "n f" '(org-roam-node-find :which-key "Find note")
       "n d s" '(org-roam-db-sync :which-key "Database sync")
       "n i" '(org-roam-node-insert :which-key "Insert org-roam node link")

       ;; Toggle - Narrow
       "t e" '(widen :which-key "Widen / Escape narrowed area.")
       "t t" '(org-narrow-to-subtree :which-key "Narrow to subtree.")
       "t b" '(org-narrow-to-block :which-key "Narrow to source block / block of text.")
       "t l" '(org-narrow-to-element :which-key "Narrow to line."))

(nvmap :states '(normal) :keymaps 'override :prefix "SPC"
       "p i" '(pdf-view-midnight-minor-mode :which-key "Invert PDF colors"))

;;(nvmap :states '(normal) :keymaps 'override :prefix "SPC"
       ;; T - toggle
       ;;"t c" '(centered-cursor-mode :which-key "Toggle centered cursor mode")
       ;;"t C" '(global-centered-cursor-mode :which-key "Toggle centered cursor mode on all buffers"))
       ;;"t s" '(scroll-lock-mode :which-key "Scroll lock mode") ;; Disabled for centered-cursor-mode
       ;;"t t" '(toggle-window-transparency :which-key "Toggle transparency")

(use-package perspective
  :bind
  ("C-x C-b" . persp-list-buffers)
  :custom
  (persp-mode-prefix-key (kbd "C-c M-p"))
  (persp-state-default-file "~/.config/emacs/persp-save")
  :init
  (persp-mode))

(add-hook 'kill-emacs-hook #'persp-state-save)

(use-package counsel
      :bind (( "M-x" . counsel-M-x)
	( "C-x b" . counsel-ibuffer)
	( "C-x C-f" . counsel-find-file)
      :map minibuffer-local-map
	( "C-r" . 'counsel-minibuffer-history)))
  ;;    :config
(setq ivy-initial-inputs-alist nil) ;; Don't start searches with ^

(ivy-mode)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)

(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
       :map ivy-minibuffer-map
       ("TAB" . ivy-alt-done)	
       ("C-l" . ivy-alt-done)
       ("C-j" . ivy-next-line)
       ("C-k" . ivy-previous-line)
       :map ivy-switch-buffer-map
       ("C-k" . ivy-previous-line)
       ("C-l" . ivy-done)
       ("C-d" . ivy-switch-buffer-kill) 
       :map ivy-reverse-i-search-map
       ("C-k" . ivy-previous-line)
       ("C-d" . ivy-reverse-i-search-kill)))
;;TEST (NOT WORKIGN YET)
;;(global-set-key (kbd "SPC .") 'counsel-find-file)
;;(global-set-key (kbd "SPC ,") 'counsel-switch-buffer)

;; enable this if you want `swiper' to use it
;; (setq search-default-mode #'char-fold-to-regexp)
;;(global-set-key "\C-s" 'swiper)
;;(global-set-key (kbd "C-c C-r") 'ivy-resume)
;;(global-set-key (kbd "<f6>") 'ivy-resume)
;;(global-set-key (kbd "M-x") 'counsel-M-x)
;;(global-set-key (kbd "C-x C-f") 'counsel-find-file)
;;(global-set-key (kbd "<f1> f") 'counsel-describe-function)
;;(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
;;(global-set-key (kbd "<f1> o") 'counsel-describe-symbol)
;;(global-set-key (kbd "<f1> l") 'counsel-find-library)
;;(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
;;(global-set-key (kbd "<f2> u") 'counsel-unicode-char)
;;(global-set-key (kbd "C-c g") 'counsel-git)
;;(global-set-key (kbd "C-c j") 'counsel-git-grep)
;;(global-set-key (kbd "C-c k") 'counsel-ag)
;;(global-set-key (kbd "C-x l") 'counsel-locate)
;;(global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
;;(define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)

(use-package ivy-rich
  :init
  (ivy-rich-mode 1))

(use-package all-the-icons-dired)
(use-package dired-open)
(use-package peep-dired)

(nvmap :states '(normal visual) :keymaps 'override :prefix "SPC"
               "d d" '(dired :which-key "Open dired")
               "d j" '(dired-jump :which-key "Dired jump to current")
               "d p" '(peep-dired :which-key "Peep-dired"))

(with-eval-after-load 'dired
  ;;(define-key dired-mde-map (kbd "M-p") 'peep-dired)
  (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
  (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
  (evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file)
  (evil-define-key 'normal peep-dired-mode-map (kbd "k") 'peep-dired-prev-file))

(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
;; Get file icons in dired
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
;; Auto-refresh dired on file change
(add-hook 'dired-mode-hook 'auto-revert-mode)
;; With dired-open plugin, you can launch external programs for certain extensions
;; For example, I set all .png files to open in 'sxiv' and all .mp4 files to open in 'mpv'
(setq dired-open-extensions '(("gif" . "nsxiv")
                               ("jpg" . "nsxiv")
                              ("png" . "nsxiv")
                              ("mkv" . "mpv")
                              ("mp4" . "mpv")))
