dots/emacs/1_chemacs_testing/test/config.org
*** Which Key

"/Show me da commands./"

[[https://github.com/justbur/emacs-which-key][github page]]

#+begin_src emacs-lisp
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1
        which-key-side-window-location 'bottom
        which-key-sort-order #'which-key-key-order-alpha
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-min-display-lines 6
        which-key-side-window-slot -10
        which-key-side-window-max-height 0.25
        which-key-max-description-length 25
        which-key-allow-imprecise-window-fit t
        which-key-separator " → " ))
#+end_src

*** Valign

Visual alignment for Org Mode, Markdown and table.el tables.

+ [[https://github.com/casouri/valign][github page]]

#+begin_src emacs-lisp
(use-package valign)
;;(add-hook 'org-mode-hook #'valign-mode)
#+end_src

*** PROJECTILE (FIX)

[[https://projectile.mx/][main page]]
[[https://github.com/bbatsov/projectile][github page]]

(define-key projectile-mode-map (kbd "C-x p" 'projectile-command-map)
(projectile-mode +1))

#+begin_src emacs-lisp
(use-package projectile
  :config
  (projectile-global-mode 1))
#+end_src

*** Super-Save

+ [[https://github.com/bbatsov/super-save][github page]]

#+begin_src emacs-lisp
(unless (package-installed-p 'super-save)
  (package-refresh-contents)
  (package-install 'super-save))

(super-save-mode +1)
(setq super-save-auto-save-when-idle t)
(setq auto-save-default nil)
#+end_src

*** Helpful

A better help buffer.

[[https://github.com/Wilfred/helpful][github page]]

#+begin_src emacs-lisp
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src

** UI
*** Command Log Mode

#+begin_src emacs-lisp
(use-package command-log-mode)
#+end_src

*** All-The-Icons

 remember to install them with /M-x all-the-icons-install/

 #+begin_src emacs-lisp
 (use-package all-the-icons)
 #+end_src

*** Beacon - Cursor Blink

+ [[https://github.com/Malabarba/beacon][github page]]

#+begin_src emacs-lisp
(use-package beacon
  :config
  (beacon-mode 1))
#+end_src

*** Doom Modeline

+ [[https://github.com/seagle0128/doom-modeline][github page - doom-modeline]]
+ [[https://github.com/hlissner/emacs-hide-mode-line][github page - hide-mode-line]]
 
The bar where you see on the bottom of the window.

#+begin_src emacs-lisp
(use-package doom-modeline)
(doom-modeline-mode 1)
;; + BATTERY
(display-battery-mode 1)

;; hide the modeline with hide-mode-line-mode
(use-package hide-mode-line)
(global-hide-mode-line-mode 1)
;; some hooks for stuff in which we don't want use modeline in
;;(add-hook 'completion-list-mode-hook #'hide-mode-line-mode)
(add-hook 'neotree-mode-hook #'hide-mode-line-mode)
#+end_src

*** Emojify (display emojis)

🙊🙈🙉

#+begin_src emacs-lisp
(use-package emojify
:hook (after-init . global-emojify-mode))
#+end_src

*** Centered Cursor Mode

+ [[https://github.com/andre-r/centered-cursor-mode.el][github page]]

#+begin_src emacs-lisp
(use-package centered-cursor-mode)
(rassq-delete-all 'centered-cursor-mode auto-mode-alist) ;; Disables mode on all buffers unless started manually.

;; Keep the cursor centered to avoid sudden scroll jumps
;;(require 'centered-cursor-mode)
#+end_src

;; disable in terminal modes
;; http://stackoverflow.com/a/6849467/519736
;; also disable in Info mode, because it breaks going back with the backspace key
;;(define-global-minor-mode my-global-centered-cursor-mode centered-cursor-mode
;; (lambda ()
;;    (when (not (memq major-mode
;;                     (list 'Info-mode 'term-mode 'eshell-mode 'shell-mode 'erc-mode)))
;;      (centered-cursor-mode))))
;;(my-global-centered-cursor-mode 1)

*** Neotree

+ [[https://github.com/jaypei/emacs-neotree][github page]]
+ [[https://www.emacswiki.org/emacs/NeoTree][emacswiki]]

#+begin_src emacs-lisp
(use-package neotree)
(global-set-key [f8] 'neotree-toggle)

(setq neo-theme (if (display-graphic-p) 'icons 'arrow)) ;; Display all-the-icons icons and fonts
(setq neo-smart-open t) ;; Find current file and jump to node
;; TEST
;; (setq projectile-switch-project-action 'neotree-projectile-action)
#+end_src

*** calfw

#+begin_src emacs-lisp
;;(use-package calfw-cal)
;;(use-package calfw-org)

;;(defun my-open-calendar ()
  ;;(interactive)
  ;;(cfw:open-calendar-buffer
   ;;:contents-sources
   ;;(list
    ;;(cfw:org-create-file-source "Org" "~/sync/notes/org/irl/events.org" "Orange") ; org mode
    ;;(cfw:org-create-file-source "Agenda" "~/sync/notes/org"
    ;;(cfw:org-create-file-source "Events" "~/sync/notes/org"
    ;;)))
#+end_src

*** Writeroom Mode

Minor mode for emacs that implements distraction-free writing.

#+begin_src emacs-lisp
(use-package writeroom-mode)
#+end_src

*** password-store

+ [[https://github.com/NicolasPetton/pass][github page]]
_note_: Emacs implementation of [[id:4f81a52e-4000-4b93-9abc-e30d7920759c][pass]].

#+begin_src emacs-lisp
(use-package pass)
#+end_src

* Extra - Packages
** Blog - simple-httpd

This will enable us to create a local web server, accesible with *http://localhost:8080*, we can also access the other files on the *content/* folder like this: *http://localhost:8080/<filename>.html*

#+begin_src emacs-lisp
(use-package simple-httpd)
#+end_src

* Extra - Configuration
** Open a file instead of /Scratch/ buffer

+ [[https://superuser.com/questions/400457/how-to-automatically-open-a-file-when-emacs-start][How to automatically open a file when Emacs start? - StackExchange]]

#+begin_src emacs-lisp
(find-file "~/sync/notes/temp.org")
#+end_src

** UI - Render Modeline just in active window

This is more of a workaround, as we are just setting up the _inactive_ buffers modeline to black.

#+begin_src emacs-lisp
(set-face-attribute 'mode-line-inactive nil
		        ;;:underline t
			;;:background (face-background 'default)
		        :background "black"
			:foreground "black")

;;hide-mode-line-mode -1
#+end_src

** Disable Yes/No when Cancelling Note on Org Capture

Function to disable "yes or no" confirmation when cancelling an org-capture note.

#+begin_src emacs-lisp
(defun my/return-t (orig-fun &rest args)
    t)
(defun my/disable-yornp (orig-fun &rest args)
  (advice-add 'yes-or-no-p :around #'my/return-t)
  (advice-add 'y-or-n-p :around #'my/return-t)
  (let ((res (apply orig-fun args)))
    (advice-remove 'yes-or-no-p #'my/return-t)
    (advice-remove 'y-or-n-p #'my/return-t)
    res))
(advice-add 'org-roam-capture--finalize :around #'my/disable-yornp)
#+end_src

** Disable follow Git-controlled symbolic link

+ [[https://emacs.stackexchange.com/questions/3673/how-to-make-vc-and-magit-treat-a-symbolic-link-to-a-real-file-in-git-repo-just?rq=1][How to make vc-* and magit treat a symbolic link to a real file in git repo just like the original file? - StackExchange]]

When opening a file that is a symbolic link, don't ask whether I want to follow the link. Just do it.

#+begin_src emacs-lisp
(setq find-file-visit-truename t)
;(setq vc-follow-symlinks t) ; What does this do?
#+end_src

* Disabled
** pdf-tools

+ [[https://github.com/vedang/pdf-tools][github page]]
+ [[https://pdftools.wiki][pdftools wiki]]
+ [[https://github.com/noctuid/evil-guide#example-integration-with-pdf-tools][Evil guide, Example: Integration with Pdf Tools - github page]]

Emacs support library for PDF files.
After the install, run ~M-x pdf-tools-install RET~

;;#+begin_src emacs-lisp
(use-package pdf-tools
  ;;:pin manual
  :config
  (pdf-tools-install)
  (setq-default pdf-view-display-size 'fit-width))
  ;;(define-key pdf-view-mode-map (kbd "C-s") ;;'isearch-forward)
  ;;:custom
  ;;(pdf-annot-activate-created-annotations t ;;"automatically annotate highlights"))

;; Start in midnight-mode, inverted colors
(add-hook 'pdf-tools-enabled-hook 'pdf-view-midnight-minor-mode)

;; Hide cursor, so file doesn't blink
(add-hook 'pdf-view-mode-hook
          (lambda ()
        (set (make-local-variable 'evil-normal-state-cursor) (list nil))
        (internal-show-cursor nil nil)))
;;#+end_src

** LLM (ellama)

- [[https://github.com/s-kostyaev/ellama][github page]]

#+begin_src emacs-lisp
;(use-package ellama)
  ;:init
  ;(setopt ellama-language "German")
  ;(require 'llm-ollama)
  ;(setopt ellama-provider
		  ;(make-llm-ollama
		   ;:chat-model "zephyr:7b-beta-q6_K" :embedding-model "zephyr:7b-beta-q6_K"))
  ;; Predefined llm providers for interactive switching.
  ;; You shouldn't add ollama providers here - it can be selected interactively
  ;; without it. It is just example.
  ;(setopt ellama-providers
		  ;'(("zephyr" . (make-llm-ollama
						 ;:chat-model "zephyr:7b-beta-q6_K"
						 ;:embedding-model "zephyr:7b-beta-q6_K"))
			;("mistral" . (make-llm-ollama
						  ;:chat-model "mistral:7b-instruct-v0.2-q6_K"
						  ;:embedding-model "mistral:7b-instruct-v0.2-q6_K"))
			;("mixtral" . (make-llm-ollama
						  ;:chat-model "mixtral:8x7b-instruct-v0.1-q3_K_M-4k"
						  ;:embedding-model "mixtral:8x7b-instruct-v0.1-q3_K_M-4k")))))
#+end_src

* Delete / Add in Future
** Vertico
** Marginalia
** Keycast
** Backups

#+begin_src emacs-lisp
;; Make all backups be in the same directory.
;;(setq backup-directory-alist '(("." . "~/.saves")))

;; Specify a backup by copying (safest but slowest.)
;;(setq backup-by-copying t)
;;(setq backup-by-copying-when-linked t)

;; More backups of versions
;;(setq delete-old-versions t
      ;;kept-new-versions 6
      ;;kept-old-versions 2
      ;;version-control t)

;; Enable this if you don't want backup files
;;(setq make-backup-files nil)
#+end_src

** EAF (Emacs Application Framework)

#+begin_src emacs-lisp
;;(use-package eaf
  ;;:load-path ;;"~/.emacs.d/site-lisp/emacs-application-framework"
  ;;:custom
  ;; See https://github.com/emacs-eaf/emacs-application-framework/wiki/Customization
  ;;(eaf-browser-continue-where-left-off t)
  ;;(eaf-browser-enable-adblocker t)
  ;;(browse-url-browser-function 'eaf-open-browser)
  ;;:config
  ;;(defalias 'browse-web #'eaf-open-browser))
  ;;(eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
  ;;(eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding)
  ;;(eaf-bind-key take_photo "p" eaf-camera-keybinding)
;;(eaf-bind-key nil "M-q" eaf-browser-keybinding)) ;; unbind, see more in the Wiki

;;(require 'eaf-browser)
;;(require 'eaf-pdf-viewer)
#+end_src

