dots/emacs/config.el

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1
        which-key-side-window-location 'bottom
        which-key-sort-order #'which-key-key-order-alpha
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-min-display-lines 6
        which-key-side-window-slot -10
        which-key-side-window-max-height 0.25
        which-key-max-description-length 25
        which-key-allow-imprecise-window-fit t
        which-key-separator " → " ))

(use-package valign)
;;(add-hook 'org-mode-hook #'valign-mode)

(use-package projectile
  :config
  (projectile-global-mode 1))

(unless (package-installed-p 'super-save)
  (package-refresh-contents)
  (package-install 'super-save))

(super-save-mode +1)
(setq super-save-auto-save-when-idle t)
(setq auto-save-default nil)

(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(use-package command-log-mode)

(use-package all-the-icons)

(use-package beacon
  :config
  (beacon-mode 1))

(use-package doom-modeline)
(doom-modeline-mode 1)
;; + BATTERY
(display-battery-mode 1)

;; hide the modeline with hide-mode-line-mode
(use-package hide-mode-line)
(global-hide-mode-line-mode 1)
;; some hooks for stuff in which we don't want use modeline in
;;(add-hook 'completion-list-mode-hook #'hide-mode-line-mode)
(add-hook 'neotree-mode-hook #'hide-mode-line-mode)

(use-package emojify
:hook (after-init . global-emojify-mode))

(use-package centered-cursor-mode)
(rassq-delete-all 'centered-cursor-mode auto-mode-alist) ;; Disables mode on all buffers unless started manually.

;; Keep the cursor centered to avoid sudden scroll jumps
;;(require 'centered-cursor-mode)

(use-package neotree)
(global-set-key [f8] 'neotree-toggle)

(setq neo-theme (if (display-graphic-p) 'icons 'arrow)) ;; Display all-the-icons icons and fonts
(setq neo-smart-open t) ;; Find current file and jump to node
;; TEST
;; (setq projectile-switch-project-action 'neotree-projectile-action)

;;(use-package calfw-cal)
;;(use-package calfw-org)

;;(defun my-open-calendar ()
  ;;(interactive)
  ;;(cfw:open-calendar-buffer
   ;;:contents-sources
   ;;(list
    ;;(cfw:org-create-file-source "Org" "~/sync/notes/org/irl/events.org" "Orange") ; org mode
    ;;(cfw:org-create-file-source "Agenda" "~/sync/notes/org"
    ;;(cfw:org-create-file-source "Events" "~/sync/notes/org"
    ;;)))

(use-package writeroom-mode)

(use-package pass)

(use-package simple-httpd)

(setq browse-url-browser-function 'browse-url-generic
          browse-url-generic-program "librewolf")

(find-file "~/sync/notes/main.org")

(set-face-attribute 'mode-line-inactive nil
		        ;;:underline t
			;;:background (face-background 'default)
		        :background "black"
			:foreground "black")

;;hide-mode-line-mode -1

(defun my/return-t (orig-fun &rest args)
    t)
(defun my/disable-yornp (orig-fun &rest args)
  (advice-add 'yes-or-no-p :around #'my/return-t)
  (advice-add 'y-or-n-p :around #'my/return-t)
  (let ((res (apply orig-fun args)))
    (advice-remove 'yes-or-no-p #'my/return-t)
    (advice-remove 'y-or-n-p #'my/return-t)
    res))
(advice-add 'org-roam-capture--finalize :around #'my/disable-yornp)

(setq find-file-visit-truename t)
;(setq vc-follow-symlinks t) ; What does this do?

;; Make all backups be in the same directory.
;;(setq backup-directory-alist '(("." . "~/.saves")))

;; Specify a backup by copying (safest but slowest.)
;;(setq backup-by-copying t)
;;(setq backup-by-copying-when-linked t)

;; More backups of versions
;;(setq delete-old-versions t
      ;;kept-new-versions 6
      ;;kept-old-versions 2
      ;;version-control t)

;; Enable this if you don't want backup files
;;(setq make-backup-files nil)

;;(use-package eaf
  ;;:load-path ;;"~/.emacs.d/site-lisp/emacs-application-framework"
  ;;:custom
  ;; See https://github.com/emacs-eaf/emacs-application-framework/wiki/Customization
  ;;(eaf-browser-continue-where-left-off t)
  ;;(eaf-browser-enable-adblocker t)
  ;;(browse-url-browser-function 'eaf-open-browser)
  ;;:config
  ;;(defalias 'browse-web #'eaf-open-browser))
  ;;(eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
  ;;(eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding)
  ;;(eaf-bind-key take_photo "p" eaf-camera-keybinding)
;;(eaf-bind-key nil "M-q" eaf-browser-keybinding)) ;; unbind, see more in the Wiki

;;(require 'eaf-browser)
;;(require 'eaf-pdf-viewer)

;;(good-scroll-mode 1)
;;(global-set-key [next] #'good-scroll-up)
;;(global-set-key [prior] #'good-scroll-down)
